{
  "translated_by": "Alexander Enkerli, Erwan le Gall",
  "elements": {
    "TXT_MOBILE": "<h1>Attention</h1><p>Ce jeu est conçu pour être joué à l’aide d’appareils qui disposent d’un clavier matériel. Pour la meilleure expérience possible, veuillez y jouer à partir d’un ordinateur de bureau ou d’un ordinateur portable.</p>",
    "BTN_ENTER": "Entrer",
    "BTN_NEW_GAME": "Nouveau Jeu",
    "BTN_RESUME_SAVED": "Reprendre",
    "BTN_OBJECTIVES": "Objectifs",
    "BTN_HOW_TO": "Comment jouer",
    "BTN_ABOUT": "À propos",
    "BTN_TERMS": "Conditions d’utilisation",
    "BTN_ACCESSIBILITY": "Accessibilité",
    "BTN_CONTACTS": "Contactez-nous",
    "BTN_CLOSE": "Fermer",
    "BTN_SKIP_INTRO": "Passer l’intro",
    "BTN_NEXT": "Suivante",
    "BTN_HELP": "Ouvrir l’aide",
    "BTN_MENU": "Aller au menu",
    "BTN_TOGGLE_ANIMATION": "Activer ou désactiver l’animation",
    "BTN_TOGGLE_MUSIC": "Activer ou désactiver la musique",
    "BTN_DOWNLOAD_GUIDE": "Guide d’accessibilité",
    "TXT_GAME_TITLE": "Labyrinthe d’accessibilité",
    "TXT_AWARD": "Récipiendaire du Web4All 2021 Accessibility Challenge Award",
    "TXT_LICENSE": "Le <a href=\"https://de.ryerson.ca/wa/maze.html\" target=\"_blank\">Labyrinthe d’accessibilité</a> est disponible sous licence CC BY-SA 4.0.",
    "TXT_PRESS_SPACEBAR": "Appuyer sur la barre d’espace",
    "TXT_NO_MOUSE": "La souris ne fonctionne pas ici. Utilisez uniquement le clavier",
    "TXT_COLLECTED": "Vous avez récupéré un objet : ",
    "TXT_WALL": "Vous vous heurtez contre un mur",
    "TXT_LEVEL_ENTRANCE": "Entrée au niveau ",
    "TXT_EXIT": "Vous avez trouvé une sortie",
    "TXT_DIARY": "Vous avez trouvé le journal du Maître",
    "TXT_CLOSE_DIARY": "Appuyez sur Échap pour fermer le journal",
    "TXT_DOOR": "Vous avez ouvert la porte",
    "TXT_LOCKED_DOOR": "Vous avez trouvé une porte verrouillée",
    "TXT_REMOTE_CONTROL_DOOR": "Cette porte est télécommandée",
    "TXT_CRACKED_WALL": "Vous avez trouvé un mur fissuré",
    "TXT_CRACKED_WALL_2": "Le mur a cédé un peu",
    "TXT_SECRET": "Vous avez trouvé un secret",
    "TXT_LOCKED_CHEST": "Vous avez trouvé un coffre verrouillé",
    "TXT_EMPTY_CHEST": "Vous avez trouvé un coffre déverrouillé vide",
    "TXT_SWITCH_ON": "Vous avez activé l’interrupteur. Une porte s’est ouverte ailleurs",
    "TXT_SWITCH_OFF": "L’interrupteur est désactivé. Une porte s’est fermée ailleurs",
    "TXT_SWITCH_FROZEN": "L’interrupteur est gelé. Une porte s’est ouverte ailleurs",
    "TXT_BALLOON": "Votre passage est bloqué par le ballon",
    "TXT_BALLOON_2": "Essayez de faire éclater les ballons avec votre souris",
    "TXT_BALLOON_2_A11Y": "Appuyez sur Ctrl + Maj + touche fléchée pour faire éclater des ballons",
    "TXT_PROF": "Vous avez trouvé le professeur X",
    "TXT_NOT_ENOUGH_GEMS": "Vous n’avez pas assez de gemmes pour ouvrir cette porte",
    "TXT_MISSING_PIECE": "Il manque un morceau de métal dans la serrure",
    "TXT_MISSING_PHOTO": "Trouvez la photo d’un chat pour résoudre ce puzzle",
    "TXT_COMBINATION_TOO_LONG": "La combinaison de touches est trop longue",
    "TXT_MESSAGE_LOCKED": "VERROUILLÉ",
    "TXT_MESSAGE_UNLOCKED": "DÉVERROUILLÉ",
    "TXT_MESSAGE_ERROR": "ERREUR",
    "TXT_LANGUAGE": "Langue",
    "TXT_MOVE_LEFT": "Vous vous déplacez vers la gauche",
    "TXT_MOVE_RIGHT": "Vous vous déplacez vers la droite",
    "TXT_MOVE_UP": "Vous vous déplacez vers le haut",
    "TXT_MOVE_DOWN": "Vous vous déplacez vers le bas",
    "TXT_POP_MOVE_LEFT": "Vous avez fait éclater le ballon et vous vous déplacez vers la gauche",
    "TXT_POP_MOVE_RIGHT": "Vous avez fait éclater le ballon et vous vous déplacez vers la droite",
    "TXT_POP_MOVE_UP": "Vous avez fait éclater le ballon et vous vous déplacez vers le haut",
    "TXT_POP_MOVE_DOWN": "Vous avez fait éclater le ballon et vous vous déplacez vers le bas",
    "TXT_INTRO_SLIDE_01": "<p>Le professeur X et moi faisions des recherches sur le mystérieux maître de l’accessibilité. Les rumeurs suggéraient qu’il avait trouvé un grand secret qui rendrait le monde entier accessible.</p><p>Malheureusement, l’œuvre du Maître n’a jamais été publiée et il a lui-même disparu sans laisser de trace.</p>",
    "TXT_INTRO_SLIDE_02": "<p>Hier soir, le professeur X m’appelait pour me dire qu’il avait découvert le secret de la disparition du maître de l’accessibilité. J’avais d’autres engagements ce soir-là, alors je lui ai promis de le voir le lendemain matin.</p>",
    "TXT_INTRO_SLIDE_03": "<p>Je pouvais à peine dormir cette nuit-là en pensant au motif de l’appel du professeur. L’excitation que j’avais entendue dans sa voix a attiré ma curiosité. Que diable avait-il trouvé ?</p>",
    "TXT_INTRO_SLIDE_04": "<p>Le lendemain matin, je me précipite à la bibliothèque.</p>",
    "TXT_INTRO_SLIDE_05": "<p>Le professeur n’était pas là. Puis j’ai vu une note sur le sol. J’ai immédiatement reconnu l’écriture du professeur.</p>",
    "TXT_INTRO_SLIDE_06": "<p>La note disait que le professeur avait découvert un labyrinthe secret construit par le maître de l’accessibilité sous la bibliothèque.</p>",
    "TXT_INTRO_SLIDE_07": "<p>Selon le professeur, l’entrée du labyrinthe était cachée derrière l’ancienne horloge, et elle ne s’ouvrait qu’à minuit.</p>",
    "TXT_INTRO_SLIDE_08": "<p>Mais l’horloge est cassée. Les aiguilles ne bougent pas. Alors comment le professeur a-t-il ouvert le passage ? J’ai essayé de bouger les aiguilles moi-même…</p>",
    "TXT_INTRO_SLIDE_09": "<p>Ça a marché ! Voyons ce qu’il y a à l’intérieur.</p>",
    "TXT_PAGE_ABOUT": "<h1>À propos</h1><div class='message'><p>Le labyrinthe d’accessibilité a été développé par l’équipe Digital Education Strategies de la <a href='https://continuing.ryerson.ca'>G. Raymond Chang School of Continuing Education</a> de <a href='https://ryerson.ca'>l’Université Ryerson</a>. Le financement est fourni par The Chang School et le gouvernement de l’Ontario. </p><p>Le but du jeu est de présenter à celles et ceux qui découvrent l’accessibilité du Web les obstacles potentiels sur le Web qui peuvent empêcher certaines personnes d’accéder au contenu. Vous ferez l’expérience des mêmes défis de la navigation sur le Web que rencontrent certaines personnes handicapées.</p><p>Pour en savoir plus, visitez les <a href='https://de.ryerson.ca/wa/'>ressources d’enseignement et d’apprentissage sur l’accessibilité numérique</a> de la Chang School.</p></div>",
     "TXT_PAGE_OBJECTIVES": "<h1>Objectifs d’apprentissage</h1><div class='message'><p>Le but du jeu est de présenter à celles et ceux qui découvrent l’accessibilité du Web les obstacles potentiels sur le Web qui peuvent empêcher certaines personnes d’accéder au contenu. Vous ferez l’expérience des défis de la navigation sur le Web que rencontrent certaines personnes handicapées.</p><p>Les objectifs d’apprentissage de ce jeu sont :</p><ul><li> Découvrez comment les images et autres visuels sont rendus accessibles</li><li>Comprendre comment les formulaires Web sont rendus accessibles</li><li>Découvrez comment les éléments chronométrés peuvent créer des obstacles</li><li>Découvrez pourquoi les fonctionnalités qui n’utilisent que la souris sont inaccessibles à de nombreuses personnes</li></ul></div>",
    "TXT_PAGE_HOWTO": "<h1>Comment jouer</h1><div class='message'><p>Ce jeu fonctionne de façon optimale dans les versions actuelles des navigateurs Chrome, Firefox ou Safari. Pour jouer au jeu :</p><ul><li>Utilisez le CLAVIER :<ul><li><strong>Touches fléchées</strong> &mdash; se déplacer</li><li><strong>Touche Entrée</strong> &mdash; appuyez sur les boutons</li><li><strong>Touche Échap</strong> &mdash; ferme les fenêtres contextuelles (y compris celle-ci)</li></ul></li><li>Se heurter à des objets pour interagir</li><li>Faites attention aux messages d’état sous la carte</li></ul></div>",
    "TXT_PAGE_CONTACTS": "<h1>Contactez-nous</h1><div class='message'><p>Les questions ou commentaires sur le jeu peuvent être adressés à <a href='mailto:dehelp@ryerson.ca'>dehelp@ryerson.ca</a>.</p></div>",
    "TXT_PAGE_ACCESSIBILITY": "<h1>Accessibilité</h1><div class='message'><p>Le labyrinthe d’accessibilité a été conçu pour être accessible aux lecteurs d’écran.<ul><li>Jouez au jeu en utilisant NVDA avec Firefox ou en utilisant ChromeVox avec le navigateur Web Chrome.</li><li>Ou utilisez JAWS 2020, ou une version plus récente, avec le navigateur Web Chrome ou Firefox actuel.</li><li>Désactivez la musique de fond à l’aide du bouton Audio au-dessus du labyrinthe.</li><li>Le deuxième bouton au-dessus du labyrinthe vous renvoie au menu du jeu.</li><li>Écoutez les raccourcis du lecteur d’écran pendant le jeu.</li><li>Naviguez lentement pour entendre tous les messages d’état.</ul></div>",
    "TXT_PAGE_TERMS": "<h1>Conditions d’utilisation</h1><div class='message'><p>Sauf indication contraire, cette ressource est disponible pour un usage public sous la licence <a href=\"https://creativecommons.org/licenses/by-sa/4.0/\" target=\"postop\">Creative Commons Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)</a>.</p><p>Aux termes de la licence Creative Commons, vous êtes libre de partager et d’adapter cette ressource selon les conditions suivantes : Si vous partagez le contenu de cette ressource, vous devez identifier les créateurs de la ressource (Ryerson University) de manière raisonnable.</p></div>",
    "TXT_PAGE_SUMMARY": "<h1>Félicitations !</h1><div class=\"message\"><p>Vous avez terminé le jeu. S’il vous plaît <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSe-iD9PO5xRfSQbuHj39_kKIea7ZOJ6Tv-Wm03kUMsLac5Tvw/viewform?vc=0&c=0&w=1&usp=mail_form_link\" target=\"feedback\">laissez vos commentaires</a> (formulaire en anglais).</p></div>",
    "TXT_OUTRO_SLIDE_01": "<p>Finalement ! La dernière porte est ouverte ! Les secrets d’accessibilité sont à nous !</p>",
    "TXT_OUTRO_SLIDE_02": "<p>Attendez&hellip; Mais la salle est vide ! Où sont tous les secrets d’accessibilité ?! Et qui diable êtes-vous ?</p>",
    "TXT_OUTRO_SLIDE_03": "<p>Bonjour, partenaire ! Je suis le maître de l’accessibilité. Je parie que vous vous attendiez à découvrir de la magie de l’accessibilité ici.</p>",
    "TXT_OUTRO_SLIDE_04": "<p>Eh bien, il n’y a pas de magie qui puisse rendre le monde accessible. Mais il y a des choses que vous et moi pouvons faire pour nous rapprocher de cet objectif.</p>",
    "TXT_OUTRO_SLIDE_05": "<p>Procurez-vous le Guide d’accessibilité avant de quitter. Cela vous aidera dans votre nouvelle quête. Allez-y ! Rendez le monde plus accessible à tous !</p>",
    "TXT_GEM_BLUE": "une gemme bleue",
    "TXT_GEM_PINK": "une gemme rose",
    "TXT_GEM_YELLOW": "une gemme jaune",
    "TXT_KEY": "une clé",
    "TXT_L1_INFO": "Niveau 1 : 3 gemmes, une clé, un journal, un coffre et une porte verrouillée",
    "TXT_L1_BOOK": "<div class='columns'><p><u>dimanche 17 mars</u></p><p>Être le maître de l’accessibilité n’est pas facile. Avec tout ce qui se passe ici, j’ai besoin d’un endroit pour enregistrer mes pensées et mes idées. Alors, j’ai décidé de commencer un journal. Peut-être que cela m’aidera à réfléchir plus clairement.</p><p><u>samedi 23 mars</u></p><p>J’oublie toujours le mot de passe de la serrure à combinaison dans cette pièce. Aujourd’hui, j’ai reprogrammé la serrure pour utiliser le nom de mon chat.</p><p>J’ai toujours sa photo sur mon bureau. Ce serait un bon rappel si j’oubliais à nouveau le mot de passe.</p></div>",
    "TXT_L1_PHOTO": "photo de chat tachée d’encre",
    "TXT_L1_PUZZLE": "<span class=\"readersonly\">Porte avec serrure à combinaison. </span>Utilisez la touche Tab pour avancer, Maj+Tab pour reculer et la touche Entrée pour activer les éléments interactifs.",
    "TXT_L1_LESSON": "<h1>LEÇON 1 : Tout contenu visuel doit avoir une alternative textuelle :</h1><p>Lors de la création de contenu pour le Web, l’une des fonctionnalités d’accessibilité les plus importantes est la description textuelle pour un contenu visuel significatif. Cela garantit que les personnes aveugles obtiennent des informations équivalentes à celles obtenues par les personnes qui peuvent voir les images.</p><p>Dans ce casse-tête, le nom du chat au dos de la photo fournit une alternative textuelle au nom qui ne peut pas être vu sur l’image.</p><p>Apprenez-en plus sur les alternatives textuelles lorsque vous atteignez la fin du jeu.</p>",
    "TXT_L2_INFO": "Niveau 2 : 3 gemmes, une clé, un mur secret, un journal, un coffre et une porte verrouillée",
    "TXT_L2_BOOK": "<div class='columns'><p><u>lundi 1<sup>er</sup> avril</u></p><p>Aujourd’hui, la conduite d’eau principale a éclaté. Cela a été rapidement réparé. Cependant, à cause des dégâts d’eau, nous avons dû recâbler tous les boutons de la serrure à combinaison dans la pièce voisine.</p><p>Je pensais que laisser la même combinaison faciliterait la mémorisation :</p><p class='passcode'> D <span aria-hidden='true' class='readersonly'>.</span> C <span aria-hidden='true' class='readersonly'>.</span> A <span aria-hidden='true' class='readersonly'>.</span> B </p><p>Malheureusement, les étiquettes ne correspondent plus aux boutons ! Pour éviter toute confusion, j’ai dû tracer des lignes avec un marqueur pour relier les boutons aux étiquettes appropriées.</p><p><u>vendredi 19 avril</u></p><p>Il s’avère que les lignes de repère s’effacent facilement, j’ai donc demandé à mon assistant, Tom, de créer une plaque de métal avec les lignes de connexion gravées en permanence dessus.</p><p><img src='_/img/book/figure1-1.png' alt=''></p><p>La plaque est amovible et peut être rangée lorsqu’elle n’est pas utilisée.</p><p>J’'espère que plus personne ne confondra les boutons !</p></div>",
    "TXT_L2_PLATE": "plaque de métal gravée",
    "TXT_L2_PUZZLE": "<span class=\"readersonly\">Porte avec serrure à combinaison. </span>Utilisez la touche Tab pour avancer, Maj+Tab pour reculer et la touche Entrée pour activer les éléments interactifs.",
    "TXT_L2_LESSON": "<h1>LEÇON 2 : Assurez-vous que tous les boutons et champs de formulaire sont correctement étiquetés</h1><p>Lorsque les boutons ne sont pas correctement étiquetés, les formulaires peuvent être difficiles à utiliser pour certaines personnes. Le simple fait de placer du texte ou des images à côté de boutons ou de champs de formulaire n’est souvent pas suffisant - les personnes qui utilisent des lecteurs d’écran peuvent ne pas percevoir la connexion.</p><p>Dans ce puzzle, sans la plaque métallique qui relie les étiquettes aux boutons, il est difficile de déverrouiller la porte, tout comme un utilisateur de lecteur d’écran aurait du mal à remplir un formulaire sans étiquettes appropriées.</p><p>Terminez le jeu pour en savoir plus sur les étiquettes de formulaire !</p>",
    "TXT_L3_INFO": "Niveau 3 : 3 gemmes, une clé, deux murs secrets, un journal, un coffre, un interrupteur à distance et une porte verrouillée",
    "TXT_L3_BOOK": "<div class='columns'><p><u>mercredi 8 mai</u></p><p>Après avoir harcelé Tom pendant deux mois, je l’ai finalement persuadé de créer un mécanisme de fermeture automatique pour la porte de la pièce voisine.</p><p>Un savoir-faire incroyable comme d’habitude ! Cependant, le mécanisme est trop puissant. Il ferme la porte avant que je puisse y accéder. Hier soir, j’ai failli perdre mes doigts !</p><p>Je ne veux pas demander à Tom de le revoir. C’est un gars sympa, mais il lui faudra probablement encore deux mois pour le réparer.</p><p>Au lieu de cela, j’ai trouvé cette solution ingénieuse : je vais utiliser un vaporisateur réfrigérant pour ralentir le mécanisme de fermeture !</p></div>",
    "TXT_L3_SPRAY": "bidon de vaporisateur réfrigérant",
    "TXT_L3_LESSON": "<h1>LEÇON 3 : Le contenu en mouvement ou chronométré peut être mis en pause ou ralenti</h1><p>Tout le monde ne peut pas interagir avec des sites Web ou des appareils à la même vitesse &mdash; certaines personnes mettent plus de temps à accomplir les tâches. Il est important de fournir un moyen d’arrêter ou de ralentir tout contenu animé ou chronométré sur le Web pour cette raison.</p><p>Dans ce puzzle, le vaporisateur réfrigérant vous a permis d’empêcher l’interrupteur de s’éteindre, ce qui vous a donné plus de temps pour vous rendre à la sortie avant qu’elle ne se ferme.</p><p>En savoir plus sur le chronométrage et l’accessibilité à la fin du jeu.</p>",
    "TXT_L4_INFO": "Niveau 4 : 3 gemmes, une clé, un journal, trois murs secrets et une porte verrouillée",
    "TXT_L4_BOOK": "<div class='columns'><p><u>mardi 4 juin</u></p><p>Ce matin, j’ai essayé d’ouvrir l’écumeur de particules de Tom en tenant un échantillon de noyau en fusion avec mes deux mains. Après 10 minutes de tentatives vaines, j’étais prêt à fourrer ce morceau de noyau dans son…</p><p>Bon, Tom est un ingénieur brillant, mais son attitude me rend parfois fou ! Combien de fois dois-je lui dire que toutes ces machines et appareils qu’il crée pour moi doivent être facilement actionnés non seulement par les mains mais aussi par autre chose, comme un pied, un coude… un long bâton, par pitié !</p><p><u>Mercredi 5 juin</u></p><p>Je pense que je dois donner une leçon à Tom et je sais peut-être comment ! Au cours des deux derniers mois, j’ai conçu un nouveau matériau d’isolation. Il est extrêmement fort et ne peut être percé que par quelque chose de pointu et aiguisé, comme une flèche.</p><p>J’ai rempli toute la pièce à côté de la sortie avec des ballons faits de ce matériau. Maintenant, j’aimerais le voir essayer de se frayer un chemin jusqu’à la sortie à mains nues !</p></div>",
    "TXT_L4_LESSON": "<h1>LEÇON 4 : Les fonctionnalités interactives doivent fonctionner avec une souris et un clavier</h1><p>De nombreuses personnes ne sont pas en mesure d’utiliser une souris, peut-être parce qu’elles ne voient pas le curseur de la souris, ou peut-être n’ont-elles pas une main suffisamment stable pour cibler efficacement les fonctionnalités cliquables.</p><p>Dans ce puzzle, vous avez peut-être vécu un moment de frustration en essayant d’entrer dans la salle des bulles à l’aide de votre clavier. Cette frustration est courante chez les personnes qui utilisent un clavier pour naviguer sur le Web lorsqu’elles rencontrent des fonctionnalités qui ne fonctionnent qu’avec une souris.</p> <p>En savoir plus sur l’accessibilité du clavier à la fin du jeu.</p>",
    "TXT_L5_INFO": "Niveau 5 : Prof. X et une porte verrouillée",
    "TXT_L5_PROF_1": "<div class='text'><p>Professeur X :<br>Je suis si content de vous voir ! J’ai besoin de votre aide pour ouvrir la dernière porte. Il nécessite 13 gemmes pour fonctionner. Je n’ai pu en trouver que 9. Tenez, prenez les miens. Maintenant, allez ouvrir cette porte !</p></div>",
    "TXT_L5_PROF_2": "<div class='text'><p>Professeur X :<br>Allez ouvrir cette porte !</p></div>"
  }
}
