{
  "translated_by": "Ronny Hendriks",
  "elements": {
    "TXT_MOBILE": "<h1>Let op</h1><p>Dit spel is ontworpen voor apparaten met een fysiek toetsenbord! Voor de beste ervaring speel je het op een desktop computer of laptop.</p>",
    "BTN_ENTER": "Begin",
    "BTN_NEW_GAME": "Nieuw spel",
    "BTN_RESUME_SAVED": "Spel hervatten",
    "BTN_OBJECTIVES": "Leerdoelen",
    "BTN_HOW_TO": "Uitleg",
    "BTN_ABOUT": "Over het spel",
    "BTN_TERMS": "Gebruiksvoorwaarden",
    "BTN_ACCESSIBILITY": "Toegankelijkheid",
    "BTN_CONTACTS": "Neem contact op",
    "BTN_CLOSE": "Sluiten",
    "BTN_SKIP_INTRO": "Intro overslaan",
    "BTN_NEXT": "Volgende",
    "BTN_HELP": "Open hulpmenu",
    "BTN_MENU": "Ga naar hoofdmenu",
    "BTN_TOGGLE_ANIMATION": "Animaties aan/uit",
    "BTN_TOGGLE_MUSIC": "Muziek aan/uit",
    "BTN_DOWNLOAD_GUIDE": "Toegankelijkheidsgids",
    "TXT_GAME_TITLE": "Toegankelijkheidsdoolhof",
    "TXT_AWARD": "Ontvanger van de Web4All 2021 Accessibility Challenge Award",
    "TXT_LICENSE": "Het <a href=\"https://de.ryerson.ca/wa/maze.html\" target=\"_blank\">Toegankelijkheidsdoolhof</a> is onder de CC BY-SA 4.0 licentie.",
    "TXT_PRESS_SPACEBAR": "Druk op de spatiebalk",
    "TXT_NO_MOUSE": "Een muis werkt hier niet. Gebruik alleen het toetsenbord",
    "TXT_COLLECTED": "Je hebt een voorwerp verzameld: ",
    "TXT_WALL": "Je botste tegen een muur",
    "TXT_LEVEL_ENTRANCE": "Ingang naar verdieping ",
    "TXT_EXIT": "Je hebt de uitgang gevonden",
    "TXT_DIARY": "Je hebt het dagboek van de Toegankelijkheidsmeester gevonden",
    "TXT_CLOSE_DIARY": "Druk op Escape om het dagboek te sluiten",
    "TXT_DOOR": "Je hebt een deur open gemaakt",
    "TXT_LOCKED_DOOR": "Je hebt een afgesloten deur gevonden",
    "TXT_REMOTE_CONTROL_DOOR": "Deze deur wordt op afstand geopend",
    "TXT_CRACKED_WALL": "Je hebt een gescheurde muur gevonden",
    "TXT_CRACKED_WALL_2": "De muur geeft een beetje mee",
    "TXT_SECRET": "Je hebt een geheim gevonden",
    "TXT_LOCKED_CHEST": "Je hebt een afgesloten kist gevonden",
    "TXT_EMPTY_CHEST": "Je hebt een lege, open kist gevonden",
    "TXT_SWITCH_ON": "De schakelaar is aangezet. De deur is open.",
    "TXT_SWITCH_OFF": "De schakelaar staat uit. Er is ergens anders Een deur gesloten",
    "TXT_SWITCH_FROZEN": "De schakelaar is aangezet en bevroren. De deur is open",
    "TXT_BALLOON": "Je weg is geblokkeerd door een ballon",
    "TXT_BALLOON_2": "Probeer de ballonnen te laten knappen met je muis",
    "TXT_BALLOON_2_A11Y": "Gebruik Ctrl + Shift + pijltjestoetsen om ballonnen te knappen",
    "TXT_PROF": "Je hebt professor X gevonden",
    "TXT_NOT_ENOUGH_GEMS": "Je hebt niet genoeg edelstenen om deze deur open te maken",
    "TXT_MISSING_PIECE": "Er ontbreekt een metalen plaatje in dit slot",
    "TXT_MISSING_PHOTO": "Vindt een foto van een kat om deze puzzel op te lossen",
    "TXT_COMBINATION_TOO_LONG": "De combinatie is te lang",
    "TXT_MESSAGE_LOCKED": "VERGRENDELD",
    "TXT_MESSAGE_UNLOCKED": "ONTGRENDELD",
    "TXT_MESSAGE_ERROR": "FOUT",
    "TXT_LANGUAGE": "Taal",
    "TXT_MOVE_LEFT": "Je bent naar links gegaan",
    "TXT_MOVE_RIGHT": "Je bent naar rechts gegaan",
    "TXT_MOVE_UP": "Je bent naar boven gegaan",
    "TXT_MOVE_DOWN": "Je bent naar beneden gegaan",
    "TXT_POP_MOVE_LEFT": "Je knapte een ballon en bent naar links gegaan",
    "TXT_POP_MOVE_RIGHT": "Je knapte een ballon en bent naar rechts gegaan",
    "TXT_POP_MOVE_UP": "Je knapte een ballon en bent naar boven gegaan",
    "TXT_POP_MOVE_DOWN": "Je knapte een ballon en bent naar beneden gegaan",
    "TXT_INTRO_SLIDE_01": "<p>Professor X en ik deden onderzoek naar de mysterieuze Toegankelijkheidsmeester. Het gerucht ging dat hij een groot geheim had gevonden dat de hele wereld toegankelijk zou maken.</p><p>Helaas is het werk van de Toegankelijkheidsmeester nooit gepubliceerd en is hij zelf spoorloos verdwenen.</p>",
    "TXT_INTRO_SLIDE_02": "<p>Gisteravond belde Professor X om me te zeggen dat hij de verdwijning van de Toegankelijkheidsmeester had opgelost! Ik moest die avond iets anders doen, maar beloofde hem de volgende ochtend langs te komen.</p>",
    "TXT_INTRO_SLIDE_03": "<p>Ik kon die nacht bijna niet slapen en dacht steeds aan het telefoontje van de professor. De opwinding die ik in zijn stem hoorde maakte me nieuwsgierig. Wat had hij toch gevonden?</p>",
    "TXT_INTRO_SLIDE_04": "<p>De volgende ochtend haastte ik me snel naar de bibliotheek.</p>",
    "TXT_INTRO_SLIDE_05": "<p>De Professor was er niet. Toen zag ik een briefje op de grond. Ik herkende meteen het handschrift van de Professor.</p>",
    "TXT_INTRO_SLIDE_06": "<p>Op het briefje stond dat de Professor een geheim doolhof, gebouwd door de Toegankelijkheidsmeester, had gevonden onder de bibliotheek.</p>",
    "TXT_INTRO_SLIDE_07": "<p>Volgens de professor was de ingang van het doolhof verborgen achter de oude klok, maar deze ingang ging alleen om middernacht open.</p>",
    "TXT_INTRO_SLIDE_08": "<p>Maar de klok is kapot. De wijzers bewegen niet. Hoe heeft de professor de doorgang geopend? Ik probeerde de wijzers zelf te bewegen...</p>",
    "TXT_INTRO_SLIDE_09": "<p>Het is gelukt! Laten we naar binnen gaan!</p>",
    "TXT_PAGE_ABOUT": "<h1>Over het spel</h1><div class='message'><p>Het toegankelijkheidsdoolhof is ontwikkeld door het team Digitale Onderwijsstrategieën van de <a href='https://continuing.ryerson.ca'>G. Raymond Chang School of Continuing Education</a> op de <a href='https://ryerson.ca'>Ryerson University</a>. Financiering wordt verstrekt door de Chang School en de regering van Ontario.</p><p>Het doel van het spel is om mensen, nieuw op het gebied van webtoegankelijkheid, kennis te laten maken met mogelijke belemmeringen op het web die mensen kunnen verhinderen om toegang te krijgen tot de inhoud. Je zult de uitdagingen van het navigeren op het web ervaren die sommige mensen met een functiebeperking ervaren.</p><p>Voor meer informatie kun je kijken op de <a href='https://de.ryerson.ca/wa/'>Digitale Toegankelijkheid onderwijs- en leermiddelen (Engels)</a> van de Chang School.</p></div>",
    "TXT_PAGE_OBJECTIVES": "<h1>Leerdoelen</h1><div class='message'><p>Het doel van het spel is mensen, nieuw op het gebied van webtoegankelijkheid, kennis te laten maken met mogelijke belemmeringen op het web die mensen de toegang tot de inhoud kunnen ontzeggen. Je zult uitdagingen ervaren die mensen met een functiebeperking ondervinden bij het navigeren op het web.</p><p>De leerdoelen van het spel zijn:</p><ul><li>Leren hoe afbeeldingen, en andere visuals, toegankelijk worden gemaakt</li><li>Begrijpen hoe webformulieren toegankelijk worden gemaakt</li><li>Ervaren hoe elementen met een tijdslimiet barrières kunnen opwerpen</li><li>Ontdekken waarom functies die alleen met de muis werken voor veel mensen ontoegankelijk zijn.</li></ul></div>",
    "TXT_PAGE_HOWTO": "<h1>Spelinstructies</h1><div class='message'><p>Dit spel werkt het beste in recente versies van Chrome, Firefox of Safari. Om het spel te spelen:</p><ul><li>Gebruik het TOETSENBORD:<ul><li><strong>Pijltjestoetsen</strong> &mdash; rondbewegen</li><li><strong>Enter toets</strong> &mdash; activeer knoppen</li><li><strong>Esc toets</strong> &mdash; Sluit popup vensters (inclusief deze)</li></ul></li><li>Bots tegen dingen aan voor interactie</li><li>Let op de status meldingen onderaan de kaart</li></ul></div>",
    "TXT_PAGE_CONTACTS": "<h1>Neem contact op</h1><div class='message'><p>Vragen of opmerkingen over het spel kunnen, bijv voorkeur in het Engels, gericht worden aan <a href='mailto:dehelp@ryerson.ca'>dehelp@ryerson.ca</a>.</p></div>",
    "TXT_PAGE_ACCESSIBILITY": "<h1>Toegankelijkheid</h1><div class='message'><p>Het Toegankelijkheidsdoolhof is ontworpen om toegankelijk te zijn voor schermlezers.Spel het spel met: <ul><li>NVDA met Firefox</li><li>ChromeVox met Chrome</li><li>JAWS 2020 of nieuwer met de meest recente versie van Chrome of Firefox..</li><li>Schakel de achtergrondmuziek uit met de speaker knop boven aan het doolhof</li><li>De tweede knop brengt je terug naar het hoofdmenu.</li><li>Luister voor schermlezer toetscombinaties tijdens het spelen.</li><li>Navigeer rustig om alle status berichten volledig te horen.</ul></div>",
    "TXT_PAGE_TERMS": "<h1>Gebruiksvoorwaarden</h1><div class='message'><p>Tenzij anders vermeld is deze bron beschikbaar voor publiek gebruik onder <a href=\"https://creativecommons.org/licenses/by-sa/4.0/\" target=\"postop\">Creative Commons Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)</a>.</p><p>Onder de voorwaarden van de Creative Commons-licentie staat het u vrij deze bron te delen en aan te passen onder de volgende voorwaarden: Als u de inhoud van deze bron deelt, moet u de makers van de bron (Ryerson University) op een redelijke manier identificeren. </p></div>",
    "TXT_PAGE_SUMMARY": "<h1>Gefeliciteerd!</h1><div class=\"message\"><p>Je hebt het spel volbracht! <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSe-iD9PO5xRfSQbuHj39_kKIea7ZOJ6Tv-Wm03kUMsLac5Tvw/viewform?vc=0&c=0&w=1&usp=mail_form_link\" target=\"feedback\">Laat alsjeblieft je reactie en feedback achter</a>.</p></div>",
    "TXT_OUTRO_SLIDE_01": "<p>Eindelijk! De laatste deur is open! De toegankelijkheidsgeheimen zijn van ons!</p>",
    "TXT_OUTRO_SLIDE_02": "<p>Wacht eens&hellip; Deze kamer is helemaal leeg! Waar zijn alle toegankelijkheidsgeheimen?! En wie bent u?</p>",
    "TXT_OUTRO_SLIDE_03": "<p>Hallo, vriend! Ik ben de Toegankelijkheidsmeester. Je verwachtte hier vast een soort toegankelijkheidsmagie te ontdekken, of niet?</p>",
    "TXT_OUTRO_SLIDE_04": "<p>Helaas, er is geen magie die de wereld toegankelijk kan maken. Maar er zijn wel dingen die jij en ik kunnen doen om dichter bij dat doel te komen.</p>",
    "TXT_OUTRO_SLIDE_05": "<p>Neem de Toegankelijkheidsgids mee als je weggaat. Die zal je helpen bij je nieuwe zoektocht. Ga nu! Maak de wereld toegankelijker voor iedereen!</p>",
    "TXT_GEM_BLUE": "een blauwe edelsteen",
    "TXT_GEM_PINK": "een roze edelsteen",
    "TXT_GEM_YELLOW": "een gele edelsteen",
    "TXT_KEY": "een sleutel",
    "TXT_L1_INFO": "3 edelstenen, een sleutel, een dagboek, een kist en een afgesloten deur",
    "TXT_L1_BOOK": "<div class='columns'><p><u>Zondag 17 maart</u></p><p>Toegankelijkheidsmeester zijn is niet gemakkelijk. Er gbeurt hier zoveel. Ik heb een plek nodig om mijn gedachten en ideeën op te schrijven. Daarom heb ik besloten om een dagboek te beginnen. Misschien helpt het me om beter over dingen na te denken.</p><p><u>Zaterdag 23 maart</u></p><p>Ik vergeet steeds het wachtwoord voor het letterslot in deze kamer. Vandaag heb ik het wahtwoord aangepast naar de naam van mijn kat.</p><p>Ik heb altijd zijn foto op mijn bureau. Dat is een goed geheugensteuntje voor als ik ooit het wachtwoord weer vergeet.</p></div>",
    "TXT_L1_PHOTO": "foto van kat met inktvlek",
    "TXT_L1_PUZZLE": "<span class=\"readersonly\">Deur met letterslot. </span>Gebruik de Tab toets om naar het volgende knop te gaan, Shift + Tab gaat terug naar de vorige knop. Gebruik de Enter toets om een knop te selecteren.",
    "TXT_L1_LESSON": "<h1>LES 1: Alle zichtbare inhoud heeft een tekstalternatief</h1><p>Bij het maken van inhoud voor het web is een van de belangrijkste toegankelijkheidskenmerken het geven van een tekstalternatief voor betekenisvolle zichtbare enhoud. Dit zorgt ervoor dat mensen met een visuele beperking dezelfde informatie krijgen als mensen die wel beelden kunnen zien.</p><p>In deze puzzel biedt de naam van de kat op de achterkant van de foto een tekstalternatief voor de naam die op de foto zelf niet te zien is.</p><p>Lees meer over tekstalternatieven wanneer je het einde van het spel bereikt.</p>",
    "TXT_L2_INFO": "3 edelstenen, een sleutel, een gescheurde muur, een dagboek, een kist en een afgesloten deur",
    "TXT_L2_BOOK": "<div class='columns'><p><u>Maandag 1 april</u></p><p>Vandaag is de hoofdwaterleiding gesprongen. Het was snel gerepareerd, maar door de waterschade moesten we alle knoppen op het combinatieslot naar de volgende kamer opnieuw bedraden.</p><p>Ik dacht dat door dezelfde combinatie te gebruiken, het makkelijker te onthouden zou zijn:</p><p class='passcode'> D <span aria-hidden='true' class='readersonly'>.</span> C <span aria-hidden='true' class='readersonly'>.</span> A <span aria-hidden='true' class='readersonly'>.</span> B </p><p>Helaas komen de labels niet meer overeen met de knoppen! Ik heb met een markeerstif lijnen getrokken om de knoppen met de juiste labels te verbinden.</p><p><u>Vrijdag 19 april</u></p><p>Het blijkt dat markeerstiften toch gemakkelijk worden uitgewist! Ik heb mijn assistent Tomgevraagd om een metalen plaatje te maken met de lijnen erop gegraveerd.</p><p><img src='_/img/book/figure1-1.png' alt=''></p><p>Het plaatje kan uit het slot gehaald worden. Zo kunnen we hem veilig opbergen wanneer hij niet gebruikt wordt.</p><p>Ik hoop maar dat niemand de knoppen nog door elkaar zal halen!</p></div>",
    "TXT_L2_PLATE": "gegraveerde metalen plaatje",
    "TXT_L2_PUZZLE": "<span class=\"readersonly\">Deur met combinatieslot. </span>Gebruik de Tab toets om naar het volgende knop te gaan, Shift + Tab om terug te gaan naar de vorige knop en de Enter toets om een knop te activeren.",
    "TXT_L2_LESSON": "<h1>LES 2: Zorg ervoor dat alle knoppen en formulier elementen voorzien zijn van een label</h1><p>Als knoppen en formuliervelden geen goed label hebben, kunnen ze voor sommige mensen moeilijk te bedienen zijn. Het plaatsen van tekst of afbeeldingen naast knoppen of formuliervelden is vaak niet genoeg. Mensen die een schermlezer gebruiken, zien het verband misschien niet.</p><p>In deze puzzel is het, zonder het metalen plaatje die de labels met de knoppen verbindt, moeilijk om de deur te openen. Zo heeft gebruiker met een schermlezer ook moeite met het invullen van een formulier zonder de juiste labels.</p><p>Beëindig het spel om meer te leren over formulierlabels!</p>",
    "TXT_L3_INFO": "3 edelstenen, een sleutel, twee gescheurde muren, een dagboek, een kist, een afstandsschakelaar en een afgesloten deur",
    "TXT_L3_BOOK": "<div class='columns'><p><u>Woensdag 8 mei</u></p><p>Ik heb er twee maanden om meoten vragen bij Tom, maar ik heb hem eindelijk overgehaald om een zelfsluitende deur naar de volgende kamer te maken.</p><p>Geweldig vakmanschap zoals altijd, maar het mechanisme is de krachtig. De deur is alweer gesloten voordat ik er doorheen kan. Gisterenavond verloor ik bijna mijn vingers!</p><p>Ik wil Tom niet nog een keer lastig vallen om er naar te kijken. Hij is een aardige vent, maar het kost hem waarschijnlijk weer twee maanden om het aan te passen.</p><p>Maar ik heb een geniale oplossing bedacht: Ik ga een bevriezingsspray gebruiken om het sluitingsmechanisme te vertragen!</p></div>",
    "TXT_L3_SPRAY": "Bevriezingsspray",
    "TXT_L3_LESSON": "<h1>LES 3: Bewegende of tijdsafhankelijke inhoud kan worden gepauzeerd of vertraagd</h1><p>Niet iedereen kan even snel met websites of apparaten werken &mdash; sommige mensen doen er langer over om een opdracht af te ronden. Daarom is het belangrijk om bewegende of tijdsafhankelijke inhoud op het web te kunnen stoppen of vertragen.</p><p>In deze puzzel kon je met de bevriezingsspray voorkomen dat de schakelaar uitging, zodat je meer tijd had om bij de uitgang te komen voordat die weer dichtging.</p><p>Lees aan het eind van het spel meer over timing en toegankelijkheid.</p>",
    "TXT_L4_INFO": "3 edelstenen, een sleutel, een dagboek, drie gescheurde muren en een afgesloten deur",
    "TXT_L4_BOOK": "<div class='columns'><p><u>Dinsdag 4 juni</u></p><p>Vanmorgen probeerde ik Tom's deeltjesafschuimer te openen terwijl ik met mijn beide handen een gesmolten kernmonster vasthield. Na 10 minuten proberen was ik er helemaal klaar mee!</p><p>Tom is een briljante ingenieur, maar ik word soms gek van zijn houding! Hoe vaak moet ik hem nog vertellen dat al die machines en apparaten die hij voor me maakt, niet alleen met je handen bediend moeten kunnen worden, maar ook met iets anders, zoals een voet, een elleboog... een lange stok van mij part!</p><p><u>Woensdag 5 juni</u></p><p>Ik denk dat ik Tom een lesje moet leren en ik heb al een ideetje hoe! De afgelopen maanden heb ik geëxperimenteerd met een nieuw soort plastic. Het is extreem sterk en kan alleen worden doorboord door iets scherps en puntigs, zoals een naald.</p><p>Ik heb de hele kamer naast de uitgang vol gestopt met luchtballonnen die van dit plastic zijn gemaakt. Nu wil ik wel eens zien hoe hij zich met zijn blote handen een weg naar de uitgang probeert te banen!</p></div>",
    "TXT_L4_LESSON": "<h1>LES 4: Interactieve functies moeten werken met een muis en een toetsenbord</h1><p>Veel mensen zijn niet in staat een muis te gebruiken, misschien omdat ze de muisaanwijzer niet kunnen zien, of omdat ze geen vaste hand hebben waarmee ze klikbare functies goed kunnen aanklikken.</p><p>In deze puzzel heb je misschien een moment van frustratie gehad toen je probeerde de kamer met ballonnen binnen te komen met het toetsenbord. Deze frustratie komt ook vaak voor bij mensen die afhankelijk zijn van een toetsenbord om op het web te navigeren, wanneer ze stukken tegenkomen die alleen met een muis werken.</p> <p>Lees aan het eind van het spel meer over toetsenbordtoegankelijkheid.</p>",
    "TXT_L5_INFO": "Professor X en een afgesloten deur",
    "TXT_L5_PROF_1": "<div class='text'><p>Professor X:<br>Ik ben zo blij je te zien! Ik heb je hulp nodig om de laatste deur te openen. Er zijn 13 edelstenen voor nodig. Ik heb er helaas maar 9 gevonden. Hier, neem die van mij maar mee. Ga verder en open de deur!</p></div>",
    "TXT_L5_PROF_2": "<div class='text'><p>Professor X:<br>Ga, snel, open de deur!</p></div>"
  }
}
